{
  "header": {
    "name": "Agung Prasetyo",
    "role": "Backend Developer",
    "contact": "Sleman, Yogyakarta 52883 | [prasetyo.agpr@gmail.com](mailto:prasetyo.agpr@gmail.com) | [Linkedin](https://www.google.com/search?q=linkedin.com/in/agungprasetyo) | [Personal Website](http://portfolio.agprastyo.me) | [Github](https://github.com/agpprastyo)"
  },
  "summary": "Detail-oriented Backend Developer with hands-on experience in building scalable RESTful APIs using Go and PostgreSQL. Proficient in clean architecture, database integration, and containerized deployment with Docker. Seeking a Junior Backend Engineer position to contribute to real-world development challenges and deliver high-quality, secure software solutions.",
  "skills": [
    {
      "category": "Backend Development",
      "items": [
        "Go (Golang)",
        "RESTful APIs",
        "Clean Architecture",
        "JWT Authentication",
        "RBAC"
      ]
    },
    {
      "category": "Databases & Caching",
      "items": [
        "PostgreSQL (Schema & Queries)",
        "Redis",
        "SQL",
        "Database Migrations"
      ]
    },
    {
      "category": "Tools & Workflow",
      "items": [
        "Git",
        "Docker",
        "Docker Compose",
        "Postman",
        "Swagger/OpenAPI"
      ]
    },
    {
      "category": "Frontend (Basic)",
      "items": [
        "Flutter",
        "React",
        "SvelteKit",
        "JavaScript/TypeScript"
      ]
    }
  ],
  "projects": [
    {
      "title": "POS Kasir Full Stack Point of Sales \\- Personal Project",
      "date": "June 2025 - Present",
      "stack": [
        "Golang (Fiber)",
        "React",
        "PostgreSQL",
        "Cloudflare R2",
        "JWT",
        "Swagger",
        "Docker",
        "Midtrans API"
      ],
      "description": [
        "Developed a scalable backend system for a Point of Sale (POS) application, creating 50+ RESTful API endpoints for inventory and transaction management.",
        "Integrated a dynamic QRIS via Midtrans API (Sandbox mode), enabling automated and secure cashless transaction processing.",
        "Secured application endpoints by implementing robust JWT authentication (access & refresh tokens) and Role-Based Access Control (RBAC) for 3 distinct user roles.",
        "Accelerated local development setup time by 50% by containerizing the application and database environments using Docker and Docker Compose.",
        "Ensured seamless frontend-backend integration by comprehensively documenting 100% of the APIs using Swagger/OpenAPI."
      ],
      "links": "POS Kasir – Full Stack Point of Sales \\- Personal Project | [Source Code](https://github.com/agpprastyo/POS-kasir) | [Live Demo](https://pos-kasir.agprastyo.me)"
    },
    {
      "title": "GoShort URL Shortener | Personal Project",
      "date": "Mar 2025 - May 2025",
      "stack": [
        "Go",
        "PostgreSQL",
        "Docker",
        "JWT"
      ],
      "description": [
        "Engineered a reliable URL shortener service capable of generating unique short links and redirecting users with minimal latency.",
        "Designed and integrated RESTful APIs, securing user-specific data and actions via JWT authentication.",
        "Deployed the application and PostgreSQL database efficiently using Docker containers."
      ],
      "links": "GoShort URL Shortener | Personal Project | [Source Code](https://github.com/agpprastyo/GoShort)"
    }
  ],
  "experience": "Mobile Flutter Developer Intern  \nPT. Solusi Digital Handal — Yogyakarta  \nFebruary 2024 – May 2024\n\n Converted 20+ Figma UI designs into pixel-perfect Flutter widgets across various screen sizes.  \n Integrated 5+ third-party REST APIs using HTTP packages, ensuring smooth data retrieval.  \n Streamlined application state management using the Bloc pattern, improving codebase readability and reducing debugging time.\n\nAdditional Experience\nStaff Photographer  \nLaris Studio — Sleman, Yogyakarta  \nJuly 2021 – Present\n\n Handled client projects from planning to delivery, ensuring high customer satisfaction.  \n Managed time and priorities effectively to meet strict deadlines.  \n Developed strong discipline, responsibility, and client communication skills.",
  "education": "Bachelor’s Degree in Computer Science  \nUniversitas Siber Muhammadiyah — Yogyakarta  \nMarch 2023 – Present"
}